In [28]:
import numpy as np
import pandas as pd

In [29]:
data={"İstanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,39,38]}

In [30]:
dataFrame=pd.DataFrame(data,index=["Pazartesi","Salı","Carsamba"])

In [31]:
dataFrame

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     40
Salı           29.0     NaN     39
Carsamba        NaN    25.0     38

In [32]:
dataFrame.dropna(axis=0)

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     40

In [33]:
dataFrame.dropna(axis=1)

           İzmir
Pazartesi     40
Salı          39
Carsamba      38

In [34]:
yenidata={"İstanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir":[40,39,38],"Antalya":[np.nan,np.nan,25]}

In [35]:
yeniDataFrame=pd.DataFrame(yenidata,index=["Pazartesi","Salı","Carsamba"])

In [36]:
yeniDataFrame

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    20.0     40      NaN
Salı           29.0     NaN     39      NaN
Carsamba        NaN    25.0     38     25.0

In [38]:
yeniDataFrame.dropna(axis=1,thresh=2)

           İstanbul  Ankara  İzmir
Pazartesi      30.0    20.0     40
Salı           29.0     NaN     39
Carsamba        NaN    25.0     38

In [39]:
yeniDataFrame

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    20.0     40      NaN
Salı           29.0     NaN     39      NaN
Carsamba        NaN    25.0     38     25.0

In [40]:
yeniDataFrame.fillna(1111111)

            İstanbul     Ankara  İzmir    Antalya
Pazartesi       30.0       20.0     40  1111111.0
Salı            29.0  1111111.0     39  1111111.0
Carsamba   1111111.0       25.0     38       25.0

## groupby

In [41]:
maasSozlugu={"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
            "Calısan ismi":["Ali","Nusret","Harun","Cetin","Ferdi","Ali Tahir"],
             "Maas":[100,150,200,300,400,500]
            }

In [42]:
maasDataFrame=pd.DataFrame(maasSozlugu)

In [43]:
maasDataFrame

   Departman Calısan ismi  Maas
0    Yazılım          Ali   100
1    Yazılım       Nusret   150
2  Pazarlama        Harun   200
3  Pazarlama        Cetin   300
4      Hukuk        Ferdi   400
5      Hukuk    Ali Tahir   500

In [44]:
grupObjesi=maasDataFrame.groupby("Departman")

In [45]:
grupObjesi.count()

           Calısan ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [46]:
grupObjesi.mean()

           Maas
Departman
Hukuk       450
Pazarlama   250
Yazılım     125

In [47]:
grupObjesi.max() ######## min maxları sanırım yanlış yapıyo program

          Calısan ismi  Maas
Departman
Hukuk            Ferdi   500
Pazarlama        Harun   300
Yazılım         Nusret   150

In [48]:
grupObjesi.min()

          Calısan ismi  Maas
Departman
Hukuk        Ali Tahir   400
Pazarlama        Cetin   200
Yazılım            Ali   100

In [49]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0